In [2]:
import pandas as pd

In [3]:
mdf = pd.DataFrame()

In [4]:
from pandas import DataFrame

In [5]:
mydf=DataFrame()

## -----------------------------------------------------------------------------------------------------------

In [6]:
import pandas as pd

### Create a Series Object from a Pyhton List

In [7]:
ice_cream= ['Chocolate','Vanilla','Strawberry','Rum Raisin']

s1=pd.Series(ice_cream)
s1

0     Chocolate
1       Vanilla
2    Strawberry
3    Rum Raisin
dtype: object

In [8]:
type(s1)

pandas.core.series.Series

In [9]:
a=[4,8,15,16,23,42]

a1=pd.Series(a)
a1

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [10]:
fruits=['Apple','Orange','Plum','Grapes','Blueberry']
weekdays=['Monday','Tuesday','Wednesday','Thursday','Friday']
pd.Series(data=fruits,index=weekdays)

Monday           Apple
Tuesday         Orange
Wednesday         Plum
Thursday        Grapes
Friday       Blueberry
dtype: object

### Create a Series Object from a Dictionary

In [11]:
german_dict={"Cat":"Katze",
             "Dog":"Hund",
             "Snake":"Schlange",
             "Horse":"Pferd",
             "Queue":"Schlange"}

qseries = pd.Series(german_dict)
qseries

Cat         Katze
Dog          Hund
Snake    Schlange
Horse       Pferd
Queue    Schlange
dtype: object

### Import Series with read_csv Method

In [12]:
df=pd.read_csv('Universities.csv')

In [13]:
univ=pd.read_csv('Universities.csv',usecols=['Univ'])
univ

            Univ
0          Brown
1        CalTech
2            CMU
3       Columbia
4        Cornell
5      Dartmouth
6           Duke
7     Georgetown
8        Harvard
9   JohnsHopkins
10           MIT
11  Northwestern
12     NotreDame
13     PennState
14     Princeton
15        Purdue
16      Stanford
17      TexasA&M
18    UCBerkeley
19      UChicago
20     UMichigan
21         UPenn
22           UVA
23    UWisconsin
24          Yale

### Intro to Attribute

In [14]:
qseries

Cat         Katze
Dog          Hund
Snake    Schlange
Horse       Pferd
Queue    Schlange
dtype: object

In [15]:
qseries.values

array(['Katze', 'Hund', 'Schlange', 'Pferd', 'Schlange'], dtype=object)

In [16]:
qseries.index

Index(['Cat', 'Dog', 'Snake', 'Horse', 'Queue'], dtype='object')

In [17]:
qseries.dtype

dtype('O')

In [18]:
qseries.is_unique

False

In [19]:
qseries.size

5

### Built-in Functions

#### The .head() and .tail() Methods

In [20]:
univ.head()

       Univ
0     Brown
1   CalTech
2       CMU
3  Columbia
4   Cornell

In [21]:
univ.tail()

          Univ
20   UMichigan
21       UPenn
22         UVA
23  UWisconsin
24        Yale

#### Sorting

In [22]:
qseries

Cat         Katze
Dog          Hund
Snake    Schlange
Horse       Pferd
Queue    Schlange
dtype: object

In [23]:
qseries.sort_index(inplace=True,ascending= False)
qseries

Snake    Schlange
Queue    Schlange
Horse       Pferd
Dog          Hund
Cat         Katze
dtype: object

In [24]:
qseries.sort_values(inplace=False,ascending= True)
qseries

Snake    Schlange
Queue    Schlange
Horse       Pferd
Dog          Hund
Cat         Katze
dtype: object

### Membership Test - in Keyword

In [25]:
"Cat" in qseries.values

False

In [26]:
"Cat" in qseries.index

True

### Extract Values by Index Position

In [27]:
univ

            Univ
0          Brown
1        CalTech
2            CMU
3       Columbia
4        Cornell
5      Dartmouth
6           Duke
7     Georgetown
8        Harvard
9   JohnsHopkins
10           MIT
11  Northwestern
12     NotreDame
13     PennState
14     Princeton
15        Purdue
16      Stanford
17      TexasA&M
18    UCBerkeley
19      UChicago
20     UMichigan
21         UPenn
22           UVA
23    UWisconsin
24          Yale

In [28]:
univ.iloc[2]

Univ    CMU
Name: 2, dtype: object

In [29]:
univ[1:4]

       Univ
1   CalTech
2       CMU
3  Columbia

In [30]:
univ[:5]

       Univ
0     Brown
1   CalTech
2       CMU
3  Columbia
4   Cornell

### Extract Values by Index Label

In [31]:
qseries['Cat']

'Katze'

### The .get() Method on a Series

In [32]:
qseries.get(key=['Cat','Dog'])

Cat    Katze
Dog     Hund
dtype: object

In [33]:
qseries.get(key='Elephant')

In [34]:
qseries.get(key='Elephant',default='Not in Dict')

'Not in Dict'

### Maths Methods on Series Object

In [35]:
sar=pd.read_csv('Salaries.csv',usecols=['salary'])
sar

    salary
0   186960
1    93000
2   110515
3   131205
4   104800
..     ...
73  105450
74  104542
75  124312
76  109954
77  109646

[78 rows x 1 columns]

In [36]:
sar.count()

salary    78
dtype: int64

In [37]:
sar.sum()

salary    8425855
dtype: int64

In [38]:
sar.mean()

salary    108023.782051
dtype: float64

In [39]:
sar.std()

salary    28293.661022
dtype: float64

In [40]:
sar.min()

salary    57800
dtype: int64

In [41]:
sar.max()

salary    186960
dtype: int64

In [42]:
sar.median()

salary    104671.0
dtype: float64

In [43]:
sar.mode()

   salary
0   92000

In [44]:
sar.describe()

              salary
count      78.000000
mean   108023.782051
std     28293.661022
min     57800.000000
25%     88612.500000
50%    104671.000000
75%    126774.750000
max    186960.000000

### The .idxmax() and idxmin() Methods
+ Gives you id of number you get

In [45]:
sar.max()

salary    186960
dtype: int64

In [46]:
sar.min()

salary    57800
dtype: int64

In [47]:
sar.idxmax()

salary    0
dtype: int64

In [48]:
sar.idxmin()

salary    9
dtype: int64

### The .value_counts() Method 
+ Used in column of Categorical Data
+ Count the data on the basis of values.

In [49]:
jobs=pd.read_csv('Salaries.csv',usecols=['rank'])
jobs

         rank
0        Prof
1        Prof
2        Prof
3        Prof
4        Prof
..        ...
73       Prof
74  AssocProf
75       Prof
76       Prof
77       Prof

[78 rows x 1 columns]

In [50]:
jobs.count()

rank    78
dtype: int64

In [51]:
jobs.value_counts()

rank
Prof         46
AsstProf     19
AssocProf    13
Name: count, dtype: int64

In [52]:
jobs.value_counts(ascending=True)

rank
AssocProf    13
AsstProf     19
Prof         46
Name: count, dtype: int64

### The .apply() Method

In [53]:
def salary_scale(number):
    if number < 60000:
        return 'OK'
    elif number >= 60000 and number < 100000:
        return 'Satisfactory'
    else:
        return 'Excellent'

In [54]:
sar.head()

   salary
0  186960
1   93000
2  110515
3  131205
4  104800

In [55]:
res=sar.apply(salary_scale)
print(res)

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [56]:
sar.apply(salary_scale).tail()

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [57]:
sar.apply(lambda sal : sal + 0.15*sal)

       salary
0   215004.00
1   106950.00
2   127092.25
3   150885.75
4   120520.00
..        ...
73  121267.50
74  120223.30
75  142958.80
76  126447.10
77  126092.90

[78 rows x 1 columns]